bedroom_choices = {
    '0': 0,
    '1': 1,
    '2': 2,
    '3': 3,
    '4': 4,
    '5': 5,
    '6': 6,
    '7': 7,
    '8': 8,
    '9': 9,
    '10': 10,
}

type_choices = {
    '-------': '-------',
    'آپارتمان': 'آپارتمان',
    'خانه و ویلا': 'خانه و ویلا',
    'مسکونی': 'مسکونی',
    'زمین/کلنگی': 'زمین/کلنگی',
    'متفرقه': 'متفرقه',
    'اداری و تجاری': 'اداری و تجاری'
}

contract_choices = {
    'اجاره': 'برای اجاره',
    'خرید': 'برای فروش'
}
conditions_choices = {
    '-------': '-------',
    'قابل تبدیل': 'قابل تبدیل',
    'معاوضه': 'معاوضه',
    'مشارکتی': 'مشارکتی',
    'پیش فروش': 'پیش فروش',
    'وضعیت اداری': 'وضعیت اداری',
    'وام دار': 'وام دار',
    'قدرالسهم': 'قدرالسهم',
    'پاساژ': 'پاساژ',
    'مال': 'مال',
    'باسازی شده': 'باسازی شده',
}
document_choices = {
    '-------': '-------',
    'سند مفروز': 'سند مفروز',
    'سند مشاع': 'سند مشاع',
    'سند شش دانگ': 'سند شش دانگ',
    'سند منگوله دار': 'سند منگوله دار',
    'سند تک برگ': 'سند تک برگ',
    'سند اعیان': 'سند اعیان',
    'سند عرصه': 'سند عرصه',
    'سند وقفی': 'سند وقفی',
    'سند ورثه‌ای': 'سند ورثه‌ای',
    'سند المثنی': 'سند المثنی',
    'سند معارض': 'سند معارض',
    'سند شورایی': 'سند شورایی',
    'سند وکالتی': 'سند وکالتی',
    'سند بنچاق': 'سند بنچاق',
    'سند رهنی': 'سند رهنی',
}
direction_choices = {
    '-------': '-------',
    'درب به ساختمان ': 'درب به ساختمان ',
    'درب به حیاط ': 'درب به حیاط '

}
covering_choices = {
    '-------': '-------',
    'دارد': 'دارد',
    'فرش و موکت': 'فرش و موکت',
    'کاشی و موزاییک': 'کاشی و موزاییک',
    'سنگ': 'سنگ',
    'سرامیک': 'سرامیک',
    'بتنی': 'بتنی',
    'PVC': 'PVC',
    'بامبو': 'بامبو',
    'پارکت و لمینت': 'پارکت و لمینت'
}
cooling_choices = {
    '-------': '-------',
    'دارد': 'دارد',
    'کولر آبی': 'کولر آبی',
    'کولر گازی': 'کولر گازی',
    'فن کويل': 'فن کويل',
    'اسپلیت': 'اسپلیت',
    'داکت اسپلیت': 'داکت اسپلیت',

}
heating_choices = {
    '-------': '-------',
    'دارد': 'دارد',
    'از کف': 'از کف',
    'بخاری': 'بخاری',
    'پکیج': 'پکیج',
    'شومینه': 'شومینه',
    'اسپلیت': 'اسپلیت',
    'داکت اسپلیت': 'داکت اسپلیت',
    'فن کویل': 'فن کویل',
}
water_choices = {
    '-------': '-------',
    'دارد': 'دارد',
    'آبگرمکن': 'آبگرمکن',
    'پکیج': 'پکیج',
    'موتورخانه': 'موتورخانه'
}
construction_choices = {
    '-------': '-------',
    'اسکلت بتن': 'اسکلت بتن',
    'شناژ': 'شناژ',
    'اسکلت فلزی': 'اسکلت فلزی',
    'معمولی ساز': 'معمولی ساز'
}
frontage_choices = {
    '-------': '-------',
    'نمای آجری': 'نمای آجری',
    'نمای کامپوزیت': 'نمای کامپوزیت',
    'نمای سنگ': 'نمای سنگ',
    'نمای چوبی': 'نمای چوبی',
    'نمای اتیکس': 'نمای اتیکس',
    'نمای سرامیکی': 'نمای سرامیکی',
    'نمای شیشه ای': 'نمای شیشه ای',
    'نمای مینرال': 'نمای مینرال',
    'نما رومی': 'نما رومی',
    'نانو نما ': 'نانو نما ',
    ' نمای کنیتکس': ' نمای کنیتکس'
}
advertiser_choices = {
    'شخصی': 'شخصی',
    'مشاور املاک': 'مشاور املاک',
}
